---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleRootopening
source: html/2f5cb0b5-f034-b739-24b4-cc35598bd389.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleRootopening Property

"Double Root Opening"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldDoubleRootopening { get; }
```